sifat-99/Tori_Firmware3.0/managed_components/mushbraindave__esp_cam_sensor_imx/examples/imx708_snapshot/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"

# PSRAM — frame buffers + the BMP row work live off SPIRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
# 200 MHz PSRAM is gated behind the experimental-features flag; without it
# the choice silently falls back to 20 MHz, which is far too slow to absorb
# a full-rate camera frame and every capture comes back empty.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_200M=y

# DMA writes to PSRAM go through L2. The 128 KB / 64-byte-line default turns the
# camera's stream into short bursts; 256 KB with 128-byte lines lets the DMA
# drain in half as many, larger PSRAM transactions.
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# 32 MB flash on this board
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y

# esp_video: MIPI-CSI capture + ISP
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y

# IMX708 driver + auto-detect
CONFIG_CAMERA_IMX708=y
CONFIG_CAMERA_IMX708_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_IMX219=n

# Autofocus. The VCM is a separate chip (DW9807 at I2C 0x0c) from the sensor,
# so it needs its own driver enabled; CAM_MOTOR_DW9807 selects
# CAMERA_MOTOR_DEVICE_USED, which is what lets the three symbols below turn on.
CONFIG_CAM_MOTOR_DW9807=y
CONFIG_CAM_MOTOR_DW9807_AUTO_DETECT=y
# These three all default to y once a motor driver exists, and are spelled out
# so a future default change cannot quietly leave the lens unmoved - which looks
# like a lens problem, not a config problem. Dropping any one of them gives a
# different failure: without the IPA algorithm nothing decides where to focus,
# without the motor controller esp_video has no way to reach the VCM, and
# without the pipeline control the AF result is computed and then discarded.
CONFIG_ESP_IPA_AF_ALGORITHM=y
CONFIG_ESP_VIDEO_ENABLE_CAMERA_MOTOR_CONTROLLER=y
CONFIG_ESP_VIDEO_ISP_PIPELINE_CONTROL_CAMERA_MOTOR=y

# FAT long filenames on the SD card
CONFIG_FATFS_LFN_HEAP=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Console baud. Captured frames now travel down this same link, so the default
# 115200 is the bottleneck: it would take ~6 minutes to shift one raw 4.1 MB
# frame. At 2 Mbaud that is ~21 s, and a JPEG is a couple of seconds. The CH343
# bridge on this board handles multi-megabaud comfortably. Flashing is
# unaffected - esptool negotiates its own rate - so a bad value here costs a
# garbled log, not a bricked board.
# The baud is only settable under ESP_CONSOLE_UART_CUSTOM - under the default
# choice the symbol has no prompt, and kconfgen silently keeps 115200 no matter
# what this file says. "Custom" here changes nothing else: the TX/RX pins it
# exposes default to GPIO 37/38 on the P4, which is exactly what the default
# console already uses, and neither collides with the camera I2C (7/8) or the
# SD card (39-44).
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=2000000
